salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен

obshaja_summa = 0
for months in range(1, 11):# Индекс с 1 до 11 т.к. 10 месяцев в промежутке между 1 и 11.
  obshaja_summa += spend - salary
  spend *= 1 + increase

# TODO Рассчитайте подушку безопасности, чтобы протянуть 10 месяцев без долгов

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", round(obshaja_summa))
